<a href="https://colab.research.google.com/github/YahiaML/SQL_Udacity_Course/blob/main/Unit_2_SQL_Joins_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3
import pandas as pd

In [2]:
db = sqlite3.connect('/content/parch_and_posey.db')

# **L_1:** JOIN & ON

**JOIN:** Combines rows from two or more tables, based on a related column between them

In [8]:
SQL_code = '''
SELECT *
FROM accounts
LIMIT 10
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)
(1011, 'Exxon Mobil', 'www.exxonmobil.com', 41.1691563, -73.84937379, 'Sung Shields', 321510)
(1021, 'Apple', 'www.apple.com', 42.29049481, -76.08400942, 'Jodee Lupo', 321520)
(1031, 'Berkshire Hathaway', 'www.berkshirehathaway.com', 40.94902131, -75.76389759, 'Serafina Banda', 321530)
(1041, 'McKesson', 'www.mckesson.com', 42.21709326, -75.28499823, 'Angeles Crusoe', 321540)
(1051, 'UnitedHealth Group', 'www.unitedhealthgroup.com', 40.08792542, -75.57569396, 'Savanna Gayman', 321550)
(1061, 'CVS Health', 'www.cvshealth.com', 41.46779585, -73.76763638, 'Anabel Haskell', 321560)
(1071, 'General Motors', 'www.gm.com', 40.80551762, -76.7101814, 'Barrie Omeara', 321570)
(1081, 'Ford Motor', 'www.ford.com', 41.113942, -75.85422452, 'Kym Hagerman', 321580)
(1091, 'AT&ampT', 'www.att.com', 42.4974627, -74.90271225, 'Jamel Mosqueda', 321590)

In [9]:
SQL_code = '''
SELECT *
FROM accounts A
JOIN orders O ON A.id = O.account_id
LIMIT 10
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500, 1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43)
(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500, 2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03)
(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500, 3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18)
(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500, 4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24)
(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500, 5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49)
(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500, 6, 1001, '2016-03-02 15:29:32', 103, 24, 46, 173, 513.97, 179.76, 373.52, 1067.25)
(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500, 7, 1001, '2016-04-01 11:20:18', 101, 33, 92, 226, 503.99, 247.17, 747.04, 1498.2)
(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500, 8, 1001, '2016-05-01 15:55:51', 95, 47, 151, 293, 474.05, 352.03, 1226.12, 2052.2)
(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500, 9, 1001, '2016-05-31 21:22:48', 91, 16, 22, 129, 454.09, 119.84, 178.64, 752.57)
(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500, 10, 1001, '2016-06-30 12:32:05', 94, 46, 8, 148, 469.06, 344.54, 64.96, 878.56)

In [11]:
SQL_code = '''
SELECT A.name account_name, R.name region_name,SR.name sales_rep_name
FROM accounts A 
JOIN sales_reps SR ON A.sales_rep_id = SR.id
JOIN region R ON SR.region_id = R.id
ORDER BY A.name
LIMIT 10
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

('3M', 'Northeast', 'Sibyl Lauria')
('ADP', 'Southeast', 'Earlie Schleusner')
('AECOM', 'Southeast', 'Moon Torian')
('AES', 'Southeast', 'Calvin Ollison')
('AIG', 'Northeast', 'Elba Felder')
('AT&ampT', 'Northeast', 'Necole Victory')
('AbbVie', 'Midwest', 'Julie Starr')
('Abbott Laboratories', 'Midwest', 'Chau Rowles')
('Advance Auto Parts', 'West', 'Marquetta Laycock')
('Aetna', 'Northeast', 'Renetta Carew')

# **L_2:** LEFT JOIN & RIGHT JOIN



```
SELECT *
FROM LEFT_TABLE
LEFT JOIN RIGHT_TABLE    # returns all the rows from left table
```
And vise versa

**Let's create a small database to make this example clear**

In [22]:
temp_database = sqlite3.connect('temp_database.db')

temp_database.execute('''
CREATE TABLE IF NOT EXISTS team(team_name text, 
                      country text);''')

temp_database.execute("INSERT INTO team VALUES('Real Madrid', 'Spain');")
temp_database.execute("INSERT INTO team VALUES('Barcelona', 'Spain');")
temp_database.execute("INSERT INTO team VALUES('Liverpool', 'UK');")
temp_database.execute("INSERT INTO team VALUES('Manchester city', 'UK');")
temp_database.execute("INSERT INTO team VALUES('Bayern Munich', 'DE');")
temp_database.execute("INSERT INTO team VALUES('Arsenal', 'UK');")

temp_database.execute('''
CREATE TABLE IF NOT EXISTS season(team_name text, 
                      season integer, 
                      played_matches integer);''')

temp_database.execute("INSERT INTO season VALUES('Real Madrid', 2019, 52);")
temp_database.execute("INSERT INTO season VALUES('Barcelona', 2019, 47);")
temp_database.execute("INSERT INTO season VALUES('Paris St Germain', 2018, 45);")
temp_database.execute("INSERT INTO season VALUES('Tottenham', 2019, 52);")
temp_database.execute("INSERT INTO season VALUES('Bayern Leverkusen', 2018, 50 );")

# This is a DataBase of fiction ^^. Unless otherwise indicated, all the names, characters, businesses, places, 
# events and incidents in this book are either the product of the author's imagination or used in a fictitious manner. 
# Any resemblance to actual persons, living or dead, or actual events is purely coincidental.

In [23]:
SQL_code = '''
SELECT *
FROM team T
LEFT JOIN season S ON T.team_name = S.team_name
'''

code_execution = temp_database.execute(SQL_code)

for row in code_execution:
  print(row)

('Real Madrid', 'Spain', 'Real Madrid', 2019, 52)
('Barcelona', 'Spain', 'Barcelona', 2019, 47)
('Liverpool', 'UK', None, None, None)
('Manchester city', 'UK', None, None, None)
('Bayern Munich', 'DE', None, None, None)
('Arsenal', 'UK', None, None, None)

Returned rows that contain **Liverpool**, **Manchester city**, **Bayern Munich**, and **Arsenal** despite that they have no link to the season table

In [24]:
SQL_code = '''
SELECT *
FROM season S
LEFT JOIN team T ON T.team_name = S.team_name
'''

code_execution = temp_database.execute(SQL_code)

for row in code_execution:
  print(row)

('Real Madrid', 2019, 52, 'Real Madrid', 'Spain')
('Barcelona', 2019, 47, 'Barcelona', 'Spain')
('Paris St Germain', 2018, 45, None, None)
('Tottenham', 2019, 52, None, None)
('Bayern Leverkusen', 2018, 50, None, None)

Returned rows that contain **Paris St Germain**, **Tottenham** and **Bayern Leverkusen** despite that they have no link to the team table